<a href="https://colab.research.google.com/github/gaganreddy7977/python-assignment/blob/main/pandas_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
#------------------loading the data set---------------------
data_set=pd.read_excel('Sample - Superstore.xls')

In [ ]:
print('Question 1: Find total number of orders in the dataset.')
data_set['Order ID'].unique()

Question 1: Find total number of orders in the dataset.

array(['CA-2016-152156', 'CA-2016-138688', 'US-2015-108966', ...,
       'CA-2014-110422', 'CA-2017-121258', 'CA-2017-119914'], dtype=object)

In [ ]:
print('Question 2: Find the earliest order date.')
data_set['Order Date'].min()

Question 2: Find the earliest order date.

Timestamp('2014-01-03 00:00:00')

In [ ]:
print('Question 3: Find the latest order date.')
data_set['Order Date'].max()

Question 3: Find the latest order date.

Timestamp('2017-12-30 00:00:00')

In [ ]:
print(' Question 4: Find the total number of unique customers.')
number=data_set['Customer Name'].unique()
unique_customers=len(number)
unique_customers

 Question 4: Find the total number of unique customers.

793

In [ ]:
print('Question 5: Find the total number of unique products sold.')
pd.Series(data_set['Product ID'].unique())

Question 5: Find the total number of unique products sold.

0       FUR-BO-10001798
1       FUR-CH-10000454
2       OFF-LA-10000240
3       FUR-TA-10000577
4       OFF-ST-10000760
             ...
1857    TEC-PH-10002817
1858    TEC-MA-10003589
1859    OFF-AP-10003099
1860    TEC-PH-10002645
1861    OFF-ST-10001627
Length: 1862, dtype: object

In [ ]:
print('Question 6: Find the total number of unique categories.')
pd.Series(data_set['Category'].unique())

Question 6: Find the total number of unique categories.

0          Furniture
1    Office Supplies
2         Technology
dtype: object

In [ ]:
print('Question 7: Find the total number of unique sub-categories.')
pd.Series(data_set['Sub-Category'].unique)

Question 7: Find the total number of unique sub-categories.

0    <bound method Series.unique of 0         Bookc...
dtype: object

In [ ]:
print('Question 8: Count number of orders in each region.')
# south_total=0
# west_total=0
# East_total=0
# center_total=0
# for i in data_set['Region']:
#   if i=='South':
#     south_total=south_total+1
#   elif i=='West':
#     west_total=west_total+1
#   elif i=='Central':
#    center_total=center_total+1
#   elif i=='East':
#     East_total=East_total+1
# print(south_total)
# print(west_total)
# print(East_total)
# print(center_total)

data_set['Region'].value_counts()

Question 8: Count number of orders in each region.

Region
West       3203
East       2848
Central    2323
South      1620
Name: count, dtype: int64

In [ ]:
print('Question 9: Count number of orders by state.')
data_set['State'].value_counts()

Question 9: Count number of orders by state.

State
California              2001
New York                1128
Texas                    985
Pennsylvania             587
Washington               506
Illinois                 492
Ohio                     469
Florida                  383
Michigan                 255
North Carolina           249
Arizona                  224
Virginia                 224
Georgia                  184
Tennessee                183
Colorado                 182
Indiana                  149
Kentucky                 139
Massachusetts            135
New Jersey               130
Oregon                   124
Wisconsin                110
Maryland                 105
Delaware                  96
Minnesota                 89
Connecticut               82
Missouri                  66
Oklahoma                  66
Alabama                   61
Arkansas                  60
Rhode Island              56
Utah                      53
Mississippi               53
South Carolina            42
Louisiana                 42
Nevada                    39
Nebraska                  38
New Mexico                37
Iowa                      30
New Hampshire             27
Kansas                    24
Idaho                     21
Montana                   15
South Dakota              12
Vermont                   11
District of Columbia      10
Maine                      8
North Dakota               7
West Virginia              4
Wyoming                    1
Name: count, dtype: int64

In [ ]:
print('Question 10: Count number of orders by city.')
data_set['City'].value_counts()

Question 10: Count number of orders by city.

City
New York City    915
Los Angeles      747
Philadelphia     537
San Francisco    510
Seattle          428
                ...
Abilene            1
Montebello         1
Kissimmee          1
Danbury            1
Springdale         1
Name: count, Length: 531, dtype: int64

In [ ]:
print('Question 11: Find the most common ship mode.')
data_set['Ship Mode'].mode()

Question 11: Find the most common ship mode.

0    Standard Class
Name: Ship Mode, dtype: object

In [ ]:
print('Question 12: Find the least common ship mode.')
least_common=data_set['Ship Mode'].min()
least_common

Question 12: Find the least common ship mode.

'First Class'

In [ ]:
print('Question 13: Count number of orders shipped with "Same Day" mode.')
data_set['Ship Mode'].value_counts()['Same Day']

Question 13: Count number of orders shipped with "Same Day" mode.

np.int64(543)

In [ ]:
print('Question 14: Count number of orders shipped with "First Class".')
data_set['Ship Mode'].value_counts()['First Class']

Question 14: Count number of orders shipped with "First Class".

np.int64(1538)

In [ ]:
print('Question 15: Count number of orders shipped with "Second Class".')
data_set['Ship Mode'].value_counts()["Second Class"]

Question 15: Count number of orders shipped with "Second Class".

np.int64(1945)

In [ ]:
print('Question 16: Count number of orders shipped with "Standard Class".')
data_set['Ship Mode'].value_counts()["Standard Class"]

Question 16: Count number of orders shipped with "Standard Class".

np.int64(5968)

In [ ]:
print('Question 17: Find number of orders in each year.')
data_set['Order Date'].dt.year.value_counts()

Question 17: Find number of orders in each year.

Order Date
2017    3312
2016    2587
2015    2102
2014    1993
Name: count, dtype: int64

In [ ]:
print('Question 18: Find number of orders in each quarter.')
data_set['Order Date'].dt.quarter

Question 18: Find number of orders in each quarter.

0       4
1       4
2       2
3       4
4       4
       ..
9989    1
9990    1
9991    1
9992    1
9993    2
Name: Order Date, Length: 9994, dtype: int32

In [ ]:
print('Question 19: Find number of orders in each month.')
data_set['Order Date'].dt.month.value_counts()

Question 19: Find number of orders in each month.

Order Date
11    1471
12    1408
9     1383
10     819
5      735
6      717
7      710
8      706
3      696
4      668
1      381
2      300
Name: count, dtype: int64

In [ ]:
print('Question 20: Find number of orders in each weekday.')
data_set['Order Date'].dt.day_name().value_counts()

Question 20: Find number of orders in each weekday.

Order Date
Monday       1871
Friday       1818
Sunday       1710
Saturday     1655
Thursday     1463
Tuesday      1106
Wednesday     371
Name: count, dtype: int64

In [ ]:
print('Question 21: Count orders with discount applied.')
discount_applied=data_set['Discount'].apply(lambda x:x>0).sum()
discount_applied

Question 21: Count orders with discount applied.

np.int64(5196)

In [ ]:
print('Question 22: Count orders without discount.')
discount_applied=data_set['Discount'].apply(lambda x:x<0).sum()
discount_applied

Question 22: Count orders without discount.

np.int64(0)

In [ ]:
print('Question 23: Count orders where discount = 0.')
discount_applied=data_set['Discount'].apply(lambda x:x==0).sum()
discount_applied

Question 23: Count orders where discount = 0.

np.int64(4798)

In [ ]:
print('Question 24: Count orders where discount > 0.2.')
discount_applied=data_set['Discount'].apply(lambda x:x>0.2).sum()
discount_applied

Question 24: Count orders where discount > 0.2.

np.int64(1393)

In [ ]:
print('Question 25: Count orders where discount = 0.5.')
discount_applied=data_set['Discount'].apply(lambda x:x==0.5).sum()
discount_applied

Question 25: Count orders where discount = 0.5.

np.int64(66)

In [ ]:
print('Question 26: Find maximum discount given.')
data_set['Discount'].max()

Question 26: Find maximum discount given.

0.8

In [ ]:
print('Question 27: Find minimum discount given.')
data_set['Discount'].min()

Question 27: Find minimum discount given.

0.0

In [ ]:
print('Question 28: Count orders where profit < 0.')
profit=data_set['Profit'].apply(lambda x:x<0).sum()
profit

Question 28: Count orders where profit < 0.

np.int64(1871)

In [ ]:
print('Question 29: Count orders where profit = 0.')
profit=data_set['Profit'].apply(lambda x:x==0).sum()
profit

Question 29: Count orders where profit = 0.

np.int64(65)

In [ ]:
print('Question 30: Count orders where profit > 100.')
profit=data_set['Profit'].apply(lambda x:x>0).sum()
profit

Question 30: Count orders where profit > 100.

np.int64(8058)

In [ ]:
print('Question 31: Count orders where sales > 1000.')
data_set['Sales'].apply(lambda x:x>1000).sum()

Question 31: Count orders where sales > 1000.

np.int64(468)

In [ ]:
print('Question 32: Find total quantity sold.')
data_set['Quantity'].sum()

Question 32: Find total quantity sold.

np.int64(37873)

In [ ]:
print('Question 33: Find average quantity per order.')
data_set['Order ID'].value_counts().sum()

Question 33: Find average quantity per order.

np.int64(9994)

In [ ]:
print('Question 34: Find average sales per order.')
total=data_set.groupby('Order ID')['Quantity'].sum()
total.mean()

Question 34: Find average sales per order.

np.float64(7.560990217608305)

In [ ]:

print('Question 35: Find average profit per order.')
total=data_set.groupby('Order ID')['Profit'].sum()
total.mean()

Question 35: Find average profit per order.

np.float64(57.17648666400478)

In [ ]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
print('Question 36: Find maximum sales in a single order.')
max_sales=data_set.groupby('Order ID')['Sales'].sum().max()
max_sales

Question 36: Find maximum sales in a single order.

23661.228

In [ ]:
print('Question 37: Find minimum sales in a single order.')
data_set.groupby('Order ID')['Sales'].sum().min()

Question 37: Find minimum sales in a single order.

0.5559999999999998

In [ ]:
print('Question 38: Find maximum profit in a single order.')
data_set.groupby('Order ID')['Profit'].sum().max()

Question 38: Find maximum profit in a single order.

8762.389099999999

In [ ]:
print('Question 39: Find minimum profit in a single order.')
data_set.groupby('Order ID')['Profit'].sum().min()

Question 39: Find minimum profit in a single order.

-6893.3748000000005

In [ ]:
print('Question 40: Find number of orders per customer.')
data_set.groupby('Order ID')['Customer ID'].sum().value_counts()

Question 40: Find number of orders per customer.

Customer ID
EP-13915                                    9
EB-13870                                    9
GM-14500                                    8
SZ-20035                                    8
BM-11785                                    8
                                           ..
JE-16165                                    1
CC-12370CC-12370                            1
AB-10600AB-10600AB-10600AB-10600AB-10600    1
DP-13000DP-13000DP-13000                    1
FM-14290FM-14290FM-14290FM-14290FM-14290    1
Name: count, Length: 2380, dtype: int64

In [ ]:
print('Question 41: Find customers who placed only 1 order.')
one_order=data_set.groupby('Order ID')['Customer Name'].sum()
one_order.unique()

Question 41: Find customers who placed only 1 order.

array(['Dennis Kane', 'Ed BraxtonEd Braxton', 'Neil Französisch', ...,
       'John LeeJohn LeeJohn LeeJohn LeeJohn LeeJohn LeeJohn Lee',
       'Grant ThorntonGrant Thornton',
       'Rob LucasRob LucasRob LucasRob LucasRob LucasRob Lucas'],
      dtype=object)

In [ ]:
print('Question 42: Find customers who placed more than 10 orders.')
data_set.groupby('Order ID')['Customer ID'].sum().value_counts().apply(lambda x: x>10 ).sum()

Question 42: Find customers who placed more than 10 orders.

np.int64(0)

In [ ]:
print('Question 43: Find total number of states represented.')
data_set['State'].value_counts()

Question 43: Find total number of states represented.

State
California              2001
New York                1128
Texas                    985
Pennsylvania             587
Washington               506
Illinois                 492
Ohio                     469
Florida                  383
Michigan                 255
North Carolina           249
Arizona                  224
Virginia                 224
Georgia                  184
Tennessee                183
Colorado                 182
Indiana                  149
Kentucky                 139
Massachusetts            135
New Jersey               130
Oregon                   124
Wisconsin                110
Maryland                 105
Delaware                  96
Minnesota                 89
Connecticut               82
Missouri                  66
Oklahoma                  66
Alabama                   61
Arkansas                  60
Rhode Island              56
Utah                      53
Mississippi               53
South Carolina            42
Louisiana                 42
Nevada                    39
Nebraska                  38
New Mexico                37
Iowa                      30
New Hampshire             27
Kansas                    24
Idaho                     21
Montana                   15
South Dakota              12
Vermont                   11
District of Columbia      10
Maine                      8
North Dakota               7
West Virginia              4
Wyoming                    1
Name: count, dtype: int64

In [ ]:
print('Question 44: Find total number of cities represented.')
data_set.columns
data_set['City'].value_counts()

Question 44: Find total number of cities represented.

City
New York City    915
Los Angeles      747
Philadelphia     537
San Francisco    510
Seattle          428
                ...
Abilene            1
Montebello         1
Kissimmee          1
Danbury            1
Springdale         1
Name: count, Length: 531, dtype: int64

In [ ]:
print('Question 45: Find number of orders placed from California.')
data_set['State'].value_counts()['California']

Question 45: Find number of orders placed from California.

np.int64(2001)

In [ ]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
print('Question 46: Find number of orders placed from New York.')
data_set['State'].value_counts()['New York']

Question 46: Find number of orders placed from New York.

np.int64(1128)

In [ ]:
print('Question 47: Find number of orders placed from Texas.')
data_set['State'].value_counts()['Texas']

Question 47: Find number of orders placed from Texas.

np.int64(985)

In [ ]:
print('Question 48: Find number of orders placed from Florida.')
data_set['State'].value_counts()['Florida']

Question 48: Find number of orders placed from Florida.

np.int64(383)

In [ ]:
print('Question 49: Find number of orders shipped after 5 days of order.')
order_to_shipped=(data_set['Ship Date']-data_set['Order Date']).dt.days
shipped_after_5days=(data_set[order_to_shipped>5]).nunique().sum()
shipped_after_5days

Question 49: Find number of orders shipped after 5 days of order.

np.int64(11203)

In [ ]:
print('Question 50: Find average shipping time in days.')
data_set['Ship Date'].mean()

Question 50: Find average shipping time in days.

Timestamp('2016-05-03 23:06:58.571142912')

In [ ]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

## Sales & Profit Analysis (Questions 51-100)

In [ ]:
print('Question 51: Find total sales.')
data_set['Sales'].value_counts()

Question 51: Find total sales.

Sales
12.960      56
19.440      39
15.552      39
10.368      36
32.400      28
            ..
1706.184     1
911.424      1
407.976      1
68.810       1
2.544        1
Name: count, Length: 6144, dtype: int64

In [ ]:
print('Question 52: Find total profit.')
data_set['Profit'].value_counts()

Question 52: Find total profit.

Profit
0.0000     65
6.2208     43
9.3312     38
3.6288     32
5.4432     32
           ..
10.2588     1
1.8688      1
3.2400      1
90.7152     1
1.9656      1
Name: count, Length: 7545, dtype: int64

In [ ]:
print('Question 53: Find average sales per order.')
data_set.groupby('Order ID')['Sales'].sum().mean()

Question 53: Find average sales per order.

np.float64(458.61466566180883)

In [ ]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
print('Question 54: Find average profit per order.')
data_set.groupby('Order ID')['Profit'].sum().mean()

Question 54: Find average profit per order.

np.float64(57.17648666400478)

In [ ]:
print("Question 55: Find sales by category.")
data_set.groupby('Category')['Sales'].sum()

Question 55: Find sales by category.

Category
Furniture          741999.7953
Office Supplies    719047.0320
Technology         836154.0330
Name: Sales, dtype: float64

In [ ]:
print('Question 56: Find profit by category.')
data_set.groupby('Category')['Profit'].sum()

Question 56: Find profit by category.

Category
Furniture           18451.2728
Office Supplies    122490.8008
Technology         145454.9481
Name: Profit, dtype: float64

In [ ]:
print('Question 57: Find sales by sub-category.')
data_set.groupby('Sub-Category')['Sales'].sum()

Question 57: Find sales by sub-category.

Sub-Category
Accessories    167380.3180
Appliances     107532.1610
Art             27118.7920
Binders        203412.7330
Bookcases      114879.9963
Chairs         328449.1030
Copiers        149528.0300
Envelopes       16476.4020
Fasteners        3024.2800
Furnishings     91705.1640
Labels          12486.3120
Machines       189238.6310
Paper           78479.2060
Phones         330007.0540
Storage        223843.6080
Supplies        46673.5380
Tables         206965.5320
Name: Sales, dtype: float64

In [ ]:
print('Question 58: Find profit by sub-category.')
data_set.groupby('Sub-Category')['Profit'].sum()

Question 58: Find profit by sub-category.

Sub-Category
Accessories    41936.6357
Appliances     18138.0054
Art             6527.7870
Binders        30221.7633
Bookcases      -3472.5560
Chairs         26590.1663
Copiers        55617.8249
Envelopes       6964.1767
Fasteners        949.5182
Furnishings    13059.1436
Labels          5546.2540
Machines        3384.7569
Paper          34053.5693
Phones         44515.7306
Storage        21278.8264
Supplies       -1189.0995
Tables        -17725.4811
Name: Profit, dtype: float64

In [ ]:
print("Question 59: Find highest sales category.")
data_set.groupby('Category')['Sales'].sum().max()

Question 59: Find highest sales category.

836154.033

In [ ]:
print('Question 60: Find highest profit category.')
data_set.groupby('Category')['Profit'].sum().max()

Question 60: Find highest profit category.

145454.94809999998

In [ ]:
print('Question 61: Find lowest profit category.')
data_set.groupby('Category')['Profit'].sum().idxmin()

Question 61: Find lowest profit category.

'Furniture'

In [ ]:
print('Question 62: Find lowest sales sub-category.')
data_set.groupby('Sub-Category')['Sales'].sum().idxmin()

Question 62: Find lowest sales sub-category.

'Fasteners'

In [ ]:
print('Question 63: Find highest profit sub-category.')
data_set.groupby('Sub-Category')['Profit'].sum().idxmax()

Question 63: Find highest profit sub-category.

'Copiers'

In [ ]:
print('Question 64: Find lowest profit sub-category.')
data_set.groupby('Sub-Category')['Profit'].sum().min()

Question 64: Find lowest profit sub-category.

-17725.481100000005

In [ ]:
print('Question 65: Find top 10 profitable products.')
profitable=data_set.groupby('Product Name')['Profit'].sum()
top_10=profitable.nlargest(10)
top_10

Question 65: Find top 10 profitable products.

Product Name
Canon imageCLASS 2200 Advanced Copier                                          25199.9280
Fellowes PB500 Electric Punch Plastic Comb Binding Machine with Manual Bind     7753.0390
Hewlett Packard LaserJet 3310 Copier                                            6983.8836
Canon PC1060 Personal Laser Copier                                              4570.9347
HP Designjet T520 Inkjet Large Format Printer - 24" Color                       4094.9766
Ativa V4110MDD Micro-Cut Shredder                                               3772.9461
3D Systems Cube Printer, 2nd Generation, Magenta                                3717.9714
Plantronics Savi W720 Multi-Device Wireless Headset System                      3696.2820
Ibico EPK-21 Electric Binding System                                            3345.2823
Zebra ZM400 Thermal Label Printer                                               3343.5360
Name: Profit, dtype: float64

In [ ]:
print('Question 66: Find top 10 least profitable products.')
profitable.nsmallest(10)

Question 66: Find top 10 least profitable products.

Product Name
Cubify CubeX 3D Printer Double Head Print                           -8879.9704
Lexmark MX611dhe Monochrome Laser Printer                           -4589.9730
Cubify CubeX 3D Printer Triple Head Print                           -3839.9904
Chromcraft Bull-Nose Wood Oval Conference Tables & Bases            -2876.1156
Bush Advantage Collection Racetrack Conference Table                -1934.3976
GBC DocuBind P400 Electric Binding System                           -1878.1662
Cisco TelePresence System EX90 Videoconferencing Unit               -1811.0784
Martin Yale Chadless Opener Electric Letter Opener                  -1299.1836
Balt Solid Wood Round Tables                                        -1201.0581
BoxOffice By Design Rectangular and Half-Moon Meeting Room Tables   -1148.4375
Name: Profit, dtype: float64

In [ ]:
print('Question 67: Find top 10 best-selling products by sales.')

In [ ]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
print('Question 67: Find top 10 best-selling products by sales.')
profitable=data_set.groupby('Product Name')['Sales'].sum()
top_10=profitable.nlargest(10)
top_10

Question 67: Find top 10 best-selling products by sales.

Product Name
Canon imageCLASS 2200 Advanced Copier                                          61599.824
Fellowes PB500 Electric Punch Plastic Comb Binding Machine with Manual Bind    27453.384
Cisco TelePresence System EX90 Videoconferencing Unit                          22638.480
HON 5400 Series Task Chairs for Big and Tall                                   21870.576
GBC DocuBind TL300 Electric Binding System                                     19823.479
GBC Ibimaster 500 Manual ProClick Binding System                               19024.500
Hewlett Packard LaserJet 3310 Copier                                           18839.686
HP Designjet T520 Inkjet Large Format Printer - 24" Color                      18374.895
GBC DocuBind P400 Electric Binding System                                      17965.068
High Speed Automatic Electric Letter Opener                                    17030.312
Name: Sales, dtype: float64

In [ ]:
print('Question 68: Find top 10 best-selling products by quantity.')
top_10=data_set.groupby('Product Name')['Quantity'].sum()
top_10.nlargest(10)

Question 68: Find top 10 best-selling products by quantity.

Product Name
Staples                                                       215
Staple envelope                                               170
Easy-staple paper                                             150
Staples in misc. colors                                        86
KI Adjustable-Height Table                                     74
Avery Non-Stick Binders                                        71
Storex Dura Pro Binders                                        71
GBC Premium Transparent Covers with Diagonal Lined Pattern     67
Situations Contoured Folding Chairs, 4/Set                     64
Staple-based wall hangings                                     62
Name: Quantity, dtype: int64

In [ ]:
print('Question 69: Find bottom 10 products by sales.')
top_10=data_set.groupby('Product Name')['Sales'].sum().nsmallest(10)
top_10

Question 69: Find bottom 10 products by sales.

Product Name
Eureka Disposable Bags for Sanitaire Vibra Groomer I Upright Vac    1.624
Avery 5                                                             5.760
Xerox 20                                                            6.480
Grip Seal Envelopes                                                 7.072
Avery Hi-Liter Pen Style Six-Color Fluorescent Set                  7.700
Avery Hi-Liter Comfort Grip Fluorescent Highlighter, Yellow Ink     7.800
Xerox 1989                                                          7.968
4009 Highlighters                                                   8.040
Stockwell Gold Paper Clips                                          8.096
Newell 308                                                          8.400
Name: Sales, dtype: float64

In [ ]:
print('Question 70: Find bottom 10 products by profit.')
data_set.groupby('Product Name')['Profit'].sum().nsmallest()

Question 70: Find bottom 10 products by profit.

Product Name
Cubify CubeX 3D Printer Double Head Print                  -8879.9704
Lexmark MX611dhe Monochrome Laser Printer                  -4589.9730
Cubify CubeX 3D Printer Triple Head Print                  -3839.9904
Chromcraft Bull-Nose Wood Oval Conference Tables & Bases   -2876.1156
Bush Advantage Collection Racetrack Conference Table       -1934.3976
Name: Profit, dtype: float64

In [ ]:
print('Question 71: Find total sales by year.')
data_set.groupby(data_set['Order Date'].dt.year)['Sales'].sum().pct_change()*100

Question 71: Find total sales by year.

Order Date
2014          NaN
2015    -2.832227
2016    29.471521
2017    20.355962
Name: Sales, dtype: float64

In [ ]:
print('Question 72: Find total profit by year.')
data_set.groupby(data_set['Order Date'].dt.year)['Profit'].sum().pct_change()*100

Question 72: Find total profit by year.

Order Date
2014          NaN
2015    24.371540
2016    32.744284
2017    14.235675
Name: Profit, dtype: float64

In [ ]:
print('Question 73: Find sales growth year by year.')
data_set.groupby(data_set['Order Date'].dt.year)['Sales'].pct_change()*100

Question 73: Find sales growth year by year.

0              NaN
1       179.409070
2       -98.002569
3              NaN
4       -97.664106
           ...
9989    245.863014
9990    -55.380883
9991    181.183123
9992    -88.552689
9993    721.486486
Name: Sales, Length: 9994, dtype: float64

In [ ]:
print('Question 74: Find profit growth year by year.')
data_set.groupby(data_set['Order Date'].dt.year)['Profit'].pct_change()*100

Question 74: Find profit growth year by year.

0              NaN
1       423.892006
2       -96.870691
3              NaN
4      -100.656970
           ...
9989     87.342466
9990    -71.906482
9991     24.051378
9992    -31.316131
9993    447.657658
Name: Profit, Length: 9994, dtype: float64

In [ ]:
print('Question 75: Find sales by quarter.')
data_set.groupby(data_set['Order Date'].dt.to_period("Q"))['Sales'].sum()

Question 75: Find sales by quarter.

Order Date
2014Q1     74447.7960
2014Q2     86538.7596
2014Q3    143633.2123
2014Q4    179627.7302
2015Q1     68851.7386
2015Q2     89124.1870
2015Q3    130259.5752
2015Q4    182297.0082
2016Q1     93237.1810
2016Q2    136082.3010
2016Q3    143787.3622
2016Q4    236098.7538
2017Q1    123144.8602
2017Q2    133764.3720
2017Q3    196251.9560
2017Q4    280054.0670
Freq: Q-DEC, Name: Sales, dtype: float64

In [ ]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
print('Question 76: Find profit by quarter.')
data_set.groupby(data_set['Order Date'].dt.to_period("Q"))['Profit'].sum()

Question 76: Find profit by quarter.

Order Date
2014Q1     3811.2290
2014Q2    11204.0692
2014Q3    12804.7218
2014Q4    21723.9541
2015Q1     9264.9416
2015Q2    12190.9224
2015Q3    16853.6194
2015Q4    23309.1203
2016Q1    11441.3708
2016Q2    16390.3394
2016Q3    15823.6048
2016Q4    38139.8593
2017Q1    23506.2026
2017Q2    15499.2085
2017Q3    26985.1325
2017Q4    27448.7260
Freq: Q-DEC, Name: Profit, dtype: float64

In [ ]:
print('Question 77: Find sales by month.')
data_set.groupby(data_set['Order Date'].dt.month_name())['Sales'].sum()

Question 77: Find sales by month.

Order Date
April        137762.1286
August       159044.0630
December     325293.5035
February      59751.2514
January       94924.8356
July         147238.0970
June         152718.6793
March        205005.4888
May          155028.8117
November     352461.0710
October      200322.9847
September    307649.9457
Name: Sales, dtype: float64

In [ ]:
print('Question 78: Find profit by month.')
data_set.groupby(data_set['Order Date'].dt.month_name())['Profit'].sum()

Question 78: Find profit by month.

Order Date
April        11587.4363
August       21776.9384
December     43369.1919
February     10294.6107
January       9134.4461
July         13832.6648
June         21285.7954
March        28594.6872
May          22411.3078
November     35468.4265
October      31784.0413
September    36857.4753
Name: Profit, dtype: float64

In [ ]:
print('Question 79: Find month with highest sales.')
data_set.groupby(data_set['Order Date'].dt.month_name())['Sales'].sum().idxmax()

Question 79: Find month with highest sales.

'November'

In [ ]:
print('Question 80: Find month with highest profit.')
data_set.groupby(data_set['Order Date'].dt.month_name())['Profit'].sum().idxmax()

Question 80: Find month with highest profit.

'December'

In [ ]:
print('Question 81: Find month with lowest sales.')
data_set.groupby(data_set['Order Date'].dt.month_name())['Sales'].sum().idxmin()

Question 81: Find month with lowest sales.

'February'

In [ ]:
print('Question 82: Find month with lowest profit.')
data_set.groupby(data_set['Order Date'].dt.month_name())['Profit'].sum().idxmin()

Question 82: Find month with lowest profit.

'January'

In [ ]:
print('Question 83: Find total sales by weekday.')
data_set.groupby(data_set['Order Date'].dt.day_name())['Sales'].sum()

Question 83: Find total sales by weekday.

Order Date
Friday       427692.2593
Monday       428937.8157
Saturday     357984.6830
Sunday       385353.8464
Thursday     321965.7785
Tuesday      287209.5022
Wednesday     88056.9752
Name: Sales, dtype: float64

In [ ]:
print('Question 84: Find total profit by weekday.')
data_set.groupby(data_set['Order Date'].dt.day_name())['Profit'].sum()

Question 84: Find total profit by weekday.

Order Date
Friday       46520.8242
Monday       51511.1146
Saturday     41277.6202
Sunday       57129.5120
Thursday     39683.7512
Tuesday      35570.3288
Wednesday    14703.8707
Name: Profit, dtype: float64

In [ ]:
print('Question 85: Find weekday with highest sales.')
data_set.groupby(data_set['Order Date'].dt.day_name())['Sales'].sum().idxmax()

Question 85: Find weekday with highest sales.

'Monday'

In [ ]:
print('Question 86: Find weekday with lowest sales.')
data_set.groupby(data_set['Order Date'].dt.day_name())['Sales'].sum().idxmin()

Question 86: Find weekday with lowest sales.

'Wednesday'

In [ ]:
print('Question 87: Find weekday with highest profit.')
data_set.groupby(data_set['Order Date'].dt.day_name())['Profit'].sum().idxmax()

Question 87: Find weekday with highest profit.

'Sunday'

In [ ]:
print('Question 88: Find weekday with lowest profit.')
data_set.groupby(data_set['Order Date'].dt.day_name())['Profit'].sum().idxmin()

Question 88: Find weekday with lowest profit.

'Wednesday'

In [ ]:
print('Question 89: Find state with highest sales.')
data_set.groupby('State')['Sales'].sum().idxmax()

Question 89: Find state with highest sales.

'California'

In [ ]:
print('Question 90: Find state with highest profit.')
data_set.groupby('State')['Profit'].sum().idxmax()

Question 90: Find state with highest profit.

'California'

In [ ]:
print('Question 91: Find state with lowest sales')
data_set.groupby('State')['Sales'].sum().idxmin()

Question 91: Find state with lowest sales

'North Dakota'

In [ ]:
print('Question 92: Find state with lowest profit.')
data_set.groupby('State')['Profit'].sum().idxmin()

Question 92: Find state with lowest profit.

'Texas'

In [ ]:
print('Question 93: Find region with highest sales.')
data_set.groupby('Region')['Sales'].sum().idxmin()

Question 93: Find region with highest sales.

'South'

In [ ]:
print('Question 94: Find region with highest profit.')
data_set.groupby('Region')['Profit'].sum().idxmax()

Question 94: Find region with highest profit.

'West'

In [ ]:
print('Question 95: Find region with lowest sales.')
data_set.groupby('Region')['Sales'].sum().idxmin()

Question 95: Find region with lowest sales.

'South'

In [ ]:
print('Question 96: Find region with lowest profit.')
data_set.groupby('Region')['Profit'].sum().idxmin()

Question 96: Find region with lowest profit.

'Central'

In [ ]:
print('Question 97: Find average discount overall.')
data_set['Discount'].mean()

Question 97: Find average discount overall.

np.float64(0.15620272163297977)

In [ ]:
print('Question 98: Find average discount in each category.')
data_set.groupby('Category')['Discount'].mean()

Question 98: Find average discount in each category.

Category
Furniture          0.173923
Office Supplies    0.157285
Technology         0.132323
Name: Discount, dtype: float64

In [ ]:
print('Question 99: Find average discount in each sub-category.')
data_set.groupby('Sub-Category')['avg discount'].sum()

Question 99: Find average discount in each sub-category.

Sub-Category
Accessories    121.057109
Appliances      72.790468
Art            124.337366
Binders        237.896745
Bookcases       35.614221
Chairs          96.377079
Copiers         10.621785
Envelopes       39.675491
Fasteners       33.895991
Furnishings    149.486005
Labels          56.857791
Machines        17.963313
Paper          213.997729
Phones         138.864220
Storage        132.147503
Supplies        29.678517
Tables          49.828668
Name: avg discount, dtype: float64

In [ ]:
print('Question 100: Compare total sales vs profit across regions.')
data_set['total sales']=data_set['Sales'].sum()
data_set['total profit']=data_set['Profit'].sum()
total_sales_regions=data_set.groupby('Region')['total sales'].sum()
total_profit_regions=data_set.groupby('Region')['total profit'].sum()
print(total_sales_regions)
print(total_profit_regions)

Question 100: Compare total sales vs profit across regions.
Region
Central    5.336398e+09
East       6.542428e+09
South      3.721465e+09
West       7.357934e+09
Name: total sales, dtype: float64
Region
Central    6.653003e+08
East       8.156587e+08
South      4.639632e+08
West       9.173297e+08
Name: total profit, dtype: float64

## Customer & Segment Analysis

In [ ]:
print('Question 101: Count customers in each region.')
data_set.groupby('Region')["Customer Name"].nunique()

Question 101: Count customers in each region.

Region
Central    629
East       674
South      512
West       686
Name: Customer Name, dtype: int64

In [ ]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit', 'OrderDate',
       'quarter', 'month', 'Month Sales', 'Quarter Profit', 'Quarter Sales',
       'Month profit', 'month_hight_sales', 'month hight profit',
       'month lowest sales', 'month lowest profit', 'Sales by Weekday',
       'total profit by weekday', 'Sales hight Weekday',
       'Sales lowest Weekday', 'hight profit by weekday',
       'lowest profit by weekday', 'avg discount', 'total sales',
       'total profit'],
      dtype='object')

In [ ]:
print('Question 102: Count customers in each state.')
data_set.groupby('State')['Customer Name'].nunique()

Question 102: Count customers in each state.

State
Alabama                  34
Arizona                 100
Arkansas                 27
California              577
Colorado                 75
Connecticut              43
Delaware                 43
District of Columbia      4
Florida                 181
Georgia                  83
Idaho                    11
Illinois                237
Indiana                  70
Iowa                     17
Kansas                   14
Kentucky                 58
Louisiana                21
Maine                     3
Maryland                 45
Massachusetts            62
Michigan                106
Minnesota                42
Mississippi              25
Missouri                 28
Montana                   8
Nebraska                 23
Nevada                   23
New Hampshire            17
New Jersey               61
New Mexico               22
New York                415
North Carolina          122
North Dakota              2
Ohio                    202
Oklahoma                 34
Oregon                   51
Pennsylvania            257
Rhode Island             25
South Carolina           19
South Dakota              5
Tennessee                84
Texas                   370
Utah                     26
Vermont                   5
Virginia                107
Washington              224
West Virginia             2
Wisconsin                52
Wyoming                   1
Name: Customer Name, dtype: int64

In [ ]:
print('Question 103: Count customers in each city.')
data_set.groupby('City')['Customer ID'].nunique()

Question 103: Count customers in each city.

City
Aberdeen        1
Abilene         1
Akron          10
Albuquerque     7
Alexandria      6
               ..
Woonsocket      3
Yonkers         6
York            2
Yucaipa         1
Yuma            4
Name: Customer ID, Length: 531, dtype: int64

In [ ]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [ ]:
print('Question 104: Find total sales by customer.')
data_set.groupby('Customer ID')['Sales'].sum().reset_index()

Question 104: Find total sales by customer.

    Customer ID     Sales
0      AA-10315  5563.560
1      AA-10375  1056.390
2      AA-10480  1790.512
3      AA-10645  5086.935
4      AB-10015   886.156
..          ...       ...
788    XP-21865  2374.658
789    YC-21895  5454.350
790    YS-21880  6720.444
791    ZC-21910  8025.707
792    ZD-21925  1493.944

[793 rows x 2 columns]

In [ ]:
print('Question 105: Find total profit by customer.')
data_set.groupby('Customer ID')['Profit'].sum().reset_index()

Question 105: Find total profit by customer.

    Customer ID     Profit
0      AA-10315  -362.8825
1      AA-10375   277.3824
2      AA-10480   435.8274
3      AA-10645   857.8033
4      AB-10015   129.3465
..          ...        ...
788    XP-21865   621.2300
789    YC-21895  1305.6290
790    YS-21880  1778.2923
791    ZC-21910 -1032.1490
792    ZD-21925   249.1307

[793 rows x 2 columns]

In [ ]:
print('Question 106: Find average sales per customer.')
data_set.groupby('Customer ID')['Sales'].mean().reset_index()

Question 106: Find average sales per customer.

    Customer ID       Sales
0      AA-10315  505.778182
1      AA-10375   70.426000
2      AA-10480  149.209333
3      AA-10645  282.607500
4      AB-10015  147.692667
..          ...         ...
788    XP-21865   84.809214
789    YC-21895  681.793750
790    YS-21880  560.037000
791    ZC-21910  258.893774
792    ZD-21925  165.993778

[793 rows x 2 columns]

In [ ]:
print('Question 107: Find average profit per customer')
data_set.groupby('Customer ID')['Profit'].mean().reset_index()

Question 107: Find average profit per customer

    Customer ID      Profit
0      AA-10315  -32.989318
1      AA-10375   18.492160
2      AA-10480   36.318950
3      AA-10645   47.655739
4      AB-10015   21.557750
..          ...         ...
788    XP-21865   22.186786
789    YC-21895  163.203625
790    YS-21880  148.191025
791    ZC-21910  -33.295129
792    ZD-21925   27.681189

[793 rows x 2 columns]

In [ ]:
print('Question 108: Find customer with highest sales.')
data_set.groupby('Customer Name')['Sales'].sum().idxmax()

Question 108: Find customer with highest sales.

'Sean Miller'

In [ ]:
print('Question 109: Find customer with highest profit.')
data_set.groupby('Customer Name')['Profit'].sum().idxmax()

Question 109: Find customer with highest profit.

'Tamara Chand'

In [ ]:
print('Question 110: Find customer with lowest sales')
data_set.groupby('Customer Name')['Sales'].min().idxmin()

Question 110: Find customer with lowest sales

'Zuschuss Carroll'

In [ ]:
#Question 111: Find customer with lowest profit.
data_set.groupby('Customer Name')['Profit'].min().idxmin()

'Cindy Stewart'

In [ ]:
#Question 112: Find customers with negative profit.
data_set.groupby('Customer Name')['Profit'].sum().loc[lambda x:x<0 ]

Customer Name
Aaron Smayling      -253.5746
Adrian Hane           -2.3146
Alan Haines         -378.5509
Alex Avila          -362.8825
Alex Grayson          -5.1371
                      ...
Victoria Pisteka   -1018.7768
Victoria Wilson     -874.6645
Vivek Grady          -52.3330
Vivek Sundaresam    -262.8093
Zuschuss Carroll   -1032.1490
Name: Profit, Length: 155, dtype: float64

In [ ]:
#Question 113: Find customers with > 10 orders.
data_set.groupby('Customer Name')['Order ID'].value_counts().loc[lambda x:x>10]

Customer Name  Order ID
Ann Chong      CA-2017-157987    12
Paul Prost     US-2016-108504    11
Seth Vernon    CA-2017-100111    14
William Brown  CA-2016-165330    11
Name: count, dtype: int64

In [ ]:
data_set.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit',
       'total_sales', 'lowest profit by weekday'],
      dtype='object')

In [ ]:
#Question 114: Find customers with < 2 orders.
data_set.groupby('Customer Name')['Order ID'].value_counts().loc[lambda x:x<2]

Customer Name       Order ID
Aaron Bergman       CA-2014-152905    1
Aaron Hawkins       CA-2016-162747    1
                    CA-2017-164000    1
                    US-2014-158400    1
Aaron Smayling      CA-2016-148747    1
                                     ..
Zuschuss Carroll    CA-2014-126802    1
                    CA-2017-115322    1
                    CA-2017-133928    1
Zuschuss Donatelli  CA-2017-141481    1
                    US-2016-147991    1
Name: count, Length: 2538, dtype: int64

In [ ]:
#Question 115: Find repeat customers across multiple years.
data_set['Years']=data_set['Order Date'].dt.year
data_set.groupby('Customer Name')['Years'].nunique().loc[lambda x:x>1]
#data_set.groupby('Customer Name')[data_set['Order Date'].dt.year].loc[lambda x:x>1]

Customer Name
Aaron Bergman         2
Aaron Hawkins         4
Aaron Smayling        3
Adam Bellavance       3
Adam Hart             4
                     ..
Xylona Preis          4
Yana Sorensen         2
Yoseph Carroll        4
Zuschuss Carroll      4
Zuschuss Donatelli    3
Name: Years, Length: 772, dtype: int64

In [ ]:
#Question 116: Find customers who ordered only once.
data_set.groupby('Customer Name')['Years'].size().loc[lambda x:x==1]

Customer Name
Anthony O'Donnell    1
Carl Jackson         1
Jocasta Rupert       1
Lela Donovan         1
Ricardo Emerson      1
Name: Years, dtype: int64

In [ ]:
#Question 117: Count customers by segment.
data_set.columns
data_set.groupby('Segment')['Customer Name'].count()

Segment
Consumer       5191
Corporate      3020
Home Office    1783
Name: Customer Name, dtype: int64

In [ ]:
#Question 118: Find sales by segment.
data_set.groupby('Segment')['Sales'].sum()

Segment
Consumer       1.161401e+06
Corporate      7.061464e+05
Home Office    4.296531e+05
Name: Sales, dtype: float64

In [ ]:
#Question 119: Find profit by segment.
data_set.groupby('Segment')['Profit'].sum()

Segment
Consumer       134119.2092
Corporate       91979.1340
Home Office     60298.6785
Name: Profit, dtype: float64

In [ ]:
#Question 120: Find most profitable segment.
data_set.groupby('Segment')['Profit'].sum().idxmax()

'Consumer'

In [ ]:
#Question 121: Find least profitable segment.
data_set.groupby('Segment')['Profit'].sum().idxmin()

'Home Office'

In [ ]:
#Question 122: Find most sales-generating segment.
data_set.columns
data_set.groupby('Segment')['Sales'].max() ########################################

Segment
Consumer       13999.96
Corporate      17499.95
Home Office    22638.48
Name: Sales, dtype: float64

In [ ]:
#Question 123: Find least sales-generating segment.
data_set.groupby('Segment')['Sales'].min() ########################################

Segment
Consumer       0.444
Corporate      0.556
Home Office    0.990
Name: Sales, dtype: float64

In [ ]:
#Question 124: Find segment with highest average discount.
data_set.groupby('Segment')['Discount'].idxmax().mean()

np.float64(86.0)

In [ ]:
#Question 125: Find segment with lowest average discount.
data_set.groupby('Segment')['Discount'].idxmin().mean()

np.float64(32.666666666666664)

In [ ]:
#Question 126: Find top 5 customers by sales in each segment.
data_set.groupby(['Segment','Customer Name'])['Sales'].sum().reset_index().sort_values(['Segment','Sales'], ascending=[True,False]).groupby('Segment').head(5) #################################################

         Segment   Customer Name      Sales
316     Consumer    Raymond Buch  15117.339
2       Consumer   Adrian Barton  14473.571
226     Consumer    Ken Lonsdale  14175.229
346     Consumer    Sanjit Chand  14142.334
161     Consumer    Hunter Lopez  12873.298
627    Corporate    Tamara Chand  19052.218
636    Corporate    Todd Sumrall  11891.751
440    Corporate    Bill Shonely  10501.653
488    Corporate    Edward Hooks  10310.880
509    Corporate  Grant Thornton   9351.212
771  Home Office     Sean Miller  25043.050
784  Home Office    Tom Ashbrook  14595.620
723  Home Office   Maria Etezadi  10663.728
715  Home Office  Karen Ferguson  10604.266
681  Home Office   Daniel Raglin   8350.868

In [ ]:
#Question 127: Find top 5 customers by profit in each segment.
data_set.groupby(['Segment','Customer Name'])['Profit'].sum().reset_index().sort_values(['Segment','Profit'],ascending=[True,False]).groupby('Segment').head(5)

         Segment         Customer Name     Profit
316     Consumer          Raymond Buch  6976.0959
346     Consumer          Sanjit Chand  5757.4119
161     Consumer          Hunter Lopez  5622.4292
2       Consumer         Adrian Barton  5444.8055
81      Consumer  Christopher Martinez  3899.8904
627    Corporate          Tamara Chand  8981.3239
545    Corporate         Keith Dawkins  3038.6254
440    Corporate          Bill Shonely  2616.0644
515    Corporate           Harry Marie  2437.9836
636    Corporate          Todd Sumrall  2371.7144
784  Home Office          Tom Ashbrook  4703.7883
681  Home Office         Daniel Raglin  2869.0760
739  Home Office          Nathan Mautz  2751.6849
645  Home Office       Adam Bellavance  2054.5885
780  Home Office         Steven Roelle  1990.4244

In [ ]:
#Question 128: Find top 5 loss-making customers.
data_set.groupby('Customer Name')['Profit'].sum().nsmallest(5)

Customer Name
Cindy Stewart    -6626.3895
Grant Thornton   -4108.6589
Luke Foster      -3583.9770
Sharelle Roach   -3333.9144
Henry Goldwyn    -2797.9635
Name: Profit, dtype: float64

In [ ]:
#Question 129: Find customers with largest order value.
data_set.columns
data_set.groupby('Customer Name')['Order ID'].nunique().nlargest()

Customer Name
Emily Phan             17
Chloris Kastensmidt    13
Erin Ashbrook          13
Joel Eaton             13
Noel Staavos           13
Name: Order ID, dtype: int64